backend/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
OR `email` = 'admin'
 LIMIT 1
---
    public function authenticate($login, $password)
    {
        $user = $this->where('username', $login)
                     ->orWhere('email', $login)
                     ->first();